Documents/СписаниеМатериалов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>СписаниеМатериалов</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ВыданноСоСклада</xr:Item>
				<xr:Item>AccountingRegister.Хозрасчетный</xr:Item>
				<xr:Item>AccumulationRegister.ОстаткиТоваровНаСкладах</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИзделиеКомплект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИзделияКомплект</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусСписанияМатериалов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатусыСписанияМатериалов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяЗатрат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиЗатрат</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХозяйственнаяОперация</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ХозяйственнаяОперация</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Материалы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЕдиницыИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Коэффициент</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РучноеДобавление</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/СписаниеМатериалов/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	омЗаполнениеРеквизиов.ЗаполнитьРеквизитыСтандартные(Объект);
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Оповестить("Запись_СписаниеМатериалов", ПараметрыЗаписи, Объект.Ссылка);
КонецПроцедуры

&НаКлиенте
Процедура МатериалыМатериалПриИзменении(Элемент)
	омЕдиницыКлиент.ЗаполнитьЕдиницуПриИзмененииМатериала(Элементы.Материалы.ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура МатериалыЕдиницыИзмеренияПриИзменении(Элемент)
	омЕдиницыКлиент.ЗаполнитьКоэффициентПриИзмененииЕдиницы(Элементы.Материалы.ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура МатериалыЕдиницыИзмеренияНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	ТД = Элементы.Материалы.ТекущиеДанные;
	Элемент.СписокВыбора.ЗагрузитьЗначения(омЕдиницыИзмерения.ЕдиницыИзмеренийНоменклатурыДляВыбора(ТД.Номенклатура));
КонецПроцедуры

&НаКлиенте
Процедура МатериалыКоличествоПриИзменении(Элемент)
	ТекущаяСтрока = Элементы.Материалы.ТекущиеДанные;
	ТекущаяСтрока.Сумма = ТекущаяСтрока.Цена * ТекущаяСтрока.Количество;
КонецПроцедуры

&НаКлиенте
Процедура МатериалыЦенаПриИзменении(Элемент)
	ТекущаяСтрока = Элементы.Материалы.ТекущиеДанные;
	ТекущаяСтрока.Сумма 				= ТекущаяСтрока.Цена * ТекущаяСтрока.Количество;
	Если ТекущаяСтрока.Цена = 0 Тогда
		ТекущаяСтрока.РучноеДобавление 	= Ложь;
	Иначе
		ТекущаяСтрока.РучноеДобавление 	= Истина;
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Функция  РасчитатьЦеныСебестоимостиНаСервере(мМатериалы, Склад, Дата, Ссылка)
	Возврат ОбщегоНазначения.ТаблицаЗначенийВМассив(омЦеныНаСервере.ПолучитьСебестоимостьМатериалов(мМатериалы, Склад, Новый МоментВремени(Дата,Ссылка)));
КонецФункции

&НаКлиенте
Процедура РасчитатьЦеныСебестоимости(Команда)
	Если НЕ ЗначениеЗаполнено(Объект.Склад) Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Поле = "Склад";
		Сообщение.Текст = "Не заполнен склад.";
		Сообщение.Сообщить();
		
	    Возврат;
	КонецЕсли;
	
	мМатериалы = Новый Массив;
	
	Для каждого текМатериал Из Объект.Материалы Цикл
		Если НЕ текМатериал.РучноеДобавление И мМатериалы.Найти(текМатериал.Номенклатура) = Неопределено Тогда
			мМатериалы.Добавить(текМатериал.Номенклатура);
		КонецЕсли;
	КонецЦикла;
	
	Если мМатериалы.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	мЦены = РасчитатьЦеныСебестоимостиНаСервере(мМатериалы, Объект.Склад, Объект.Дата, Объект.Ссылка );
	
	стОтбор = Новый Структура("РучноеДобавление,Номенклатура",Ложь, );
	Для каждого текЦена Из мЦены Цикл
		стОтбор.Материал = текЦена.Номенклатура;
		
		Для каждого текМатериал Из Объект.Материалы.НайтиСтроки(стОтбор) Цикл
			Если текМатериал.Коэффициент = 0 Тогда
				Продолжить;
			КонецЕсли;	
			
			текМатериал.Цена 	= текЦена.Цена * текМатериал.Коэффициент;
			текМатериал.Сумма 	= текМатериал.Цена * текМатериал.Количество;
		
		КонецЦикла;     	
	
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	мМатериал = Новый Массив;
	
	Для каждого текСтрока Из Объект.Материалы Цикл
		Если мМатериал.Найти(текСтрока.Номенклатура) = Неопределено Тогда
			мМатериал.Добавить(текСтрока.Номенклатура);
		Иначе	
		    Отказ = Истина;
			ПоказатьПредупреждение(,"Задвоен Номенклатура " + текСтрока.Номенклатура);
			Прервать;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры
